INSERT INTO body_parts(name)
VALUES('胸'),('背中'),('肩'),('二頭'),('三頭'),('脚'),('腹筋');

INSERT INTO exercises(parts_id, name) VALUES
(1, 'ベンチプレス'),
(1, 'インクラインベンチプレス'),
(1, 'デクラインベンチプレス'),
(1, 'ダンベルプレス'),
(1, 'インクラインダンベルプレス'),
(1, 'デクラインダンベルプレス'),
(1, 'ダンベルフライ'),
(1, 'インクラインダンベルフライ'),
(1, 'デクラインダンベルフライ'),
(1, 'ケーブルクロスオーバー（上部）'),
(1, 'ケーブルクロスオーバー（中部）'),
(1, 'ケーブルクロスオーバー（下部）'),
(1, 'ペックフライ'),
(1, 'チェストプレスマシン'),
(1, 'スミスベンチプレス'),
(1, 'スミスインクラインベンチプレス'),
(1, 'スミスデクラインベンチプレス');

INSERT INTO exercises(parts_id, name) VALUES
(2, 'デッドリフト'),
(2, 'ルーマニアンデッドリフト'),
(2, '懸垂'),
(2, 'チンアップ'),
(2, 'ラットプルダウン'),
(2, 'シーテッドロー'),
(2, 'ベントオーバーロウ（バーベル）'),
(2, 'ワンハンドロウ（ダンベル）'),
(2, 'Tバーロウ'),
(2, 'インクラインダンベルロウ'),
(2, 'ケーブルロウ'),
(2, 'スミスベントオーバーロウ'),
(2, 'シュラッグ（僧帽筋）');

INSERT INTO exercises(parts_id, name) VALUES
(3, 'ショルダープレス（バーベル）'),
(3, 'ショルダープレス（ダンベル）'),
(3, 'アーノルドプレス'),
(3, 'サイドレイズ'),
(3, 'フロントレイズ'),
(3, 'リアレイズ'),
(3, 'ケーブルサイドレイズ'),
(3, 'アップライトロウ'),
(3, 'フェイスプル'),
(3, 'マシンショルダープレス'),
(3, 'スミスショルダープレス');

INSERT INTO exercises(parts_id, name) VALUES
(4, 'バーベルカール'),
(4, 'ダンベルカール'),
(4, 'インクラインカール'),
(4, 'ハンマーカール'),
(4, 'コンセントレーションカール'),
(4, 'プリーチャーカール'),
(4, 'ケーブルカール'),
(4, 'EZバーカール'),
(4, 'スパイダーカール');

INSERT INTO exercises(parts_id, name) VALUES
(5, 'トライセプスプッシュダウン'),
(5, 'フレンチプレス'),
(5, 'スカルクラッシャー'),
(5, 'ナローベンチプレス'),
(5, 'ディップス'),
(5, 'キックバック'),
(5, 'オーバーヘッドエクステンション（ダンベル）'),
(5, 'オーバーヘッドケーブルエクステンション'),
(5, 'スミスナローベンチプレス');

INSERT INTO exercises(parts_id, name) VALUES
(6, 'スクワット'),
(6, 'フロントスクワット'),
(6, 'ブルガリアンスクワット'),
(6, 'ランジ'),
(6, 'レッグプレス'),
(6, 'レッグエクステンション'),
(6, 'レッグカール'),
(6, 'ヒップスラスト'),
(6, 'スティッフレッグデッドリフト'),
(6, 'カーフレイズ'),
(6, 'ジャンピングスクワット'),
(6, 'スミススクワット');

INSERT INTO exercises(parts_id, name) VALUES
(7, 'クランチ'),
(7, 'レッグレイズ'),
(7, 'リバースクランチ'),
(7, 'シットアップ'),
(7, 'バイシクルクランチ'),
(7, 'Vシット'),
(7, 'ロシアンツイスト'),
(7, 'プランク'),
(7, 'サイドプランク'),
(7, 'トーリーチ'),
(7, 'アブローラー');
